
# YOLOv8l with P2 head (P2,P3,P4,P5 detection)

nc: 1      # number of classes
ch: 3      # input channels

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f,  [128]]            # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f,  [256]]            # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f,  [512]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f,  [1024]]           # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9

# Head (PAFPN + extra P2 branch)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]       # cat P4
  - [-1, 3, C2f, [512]]             # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]       # cat P3
  - [-1, 3, C2f, [256]]             # 15  (P3/8)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]       # cat P2
  - [-1, 3, C2f, [128]]             # 18  (P2/4) ← extra branch

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]      # cat P3
  - [-1, 3, C2f, [256]]             # 21  (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]      # cat P4
  - [-1, 3, C2f, [512]]             # 24  (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9],  1, Concat, [1]]      # cat P5
  - [-1, 3, C2f, [1024]]            # 27  (P5/32)

  - [[18, 21, 24, 27], 1, Detect, [nc]]   # Detect at P2,P3,P4,P5
